"""
常量
"""

# ============================================================
# 通用：通道重命名映射（GDF 编号 → 标准 10-20）
# ============================================================
DEFAULT_CHANNEL_RENAMING = {
    'EEG-Fz':'Fz', 'EEG-C3':'C3', 'EEG-Cz':'Cz', 'EEG-C4':'C4', 'EEG-Pz':'Pz',
    'EEG-0':'FC5', 'EEG-1':'FC1', 'EEG-2':'FC2', 'EEG-3':'FC6',
    'EEG-4':'C5', 'EEG-5':'C1', 'EEG-6':'C2', 'EEG-7':'C6',
    'EEG-8':'CP5', 'EEG-9':'CP1', 'EEG-10':'CP2', 'EEG-11':'CP6',
    'EEG-12':'P5', 'EEG-13':'P1', 'EEG-14':'P2', 'EEG-15':'P6',
    'EEG-16':'POz',
}